gsfdgds

In [1]:
##load connection 
%load_ext sql

In [2]:
##database 
%env DATABASE_URL=postgresql://mako:mako@pg.itversity.com:5432/mako

env: DATABASE_URL=postgresql://mako:mako@pg.itversity.com:5432/mako

In [10]:
%sql SELECT * from orders limit 2

 * postgresql://mako:***@pg.itversity.com:5432/mako
2 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT')]

In [11]:
%sql SELECT * from order_items limit 2

 * postgresql://mako:***@pg.itversity.com:5432/mako
2 rows affected.

[(1, 1, 957, 1, 299.98, 299.98), (2, 2, 1073, 1, 199.99, 199.99)]

In [9]:
##Get total number of orders 
%sql SELECT sum(order_id)  from orders

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(2372468286,)]

In [12]:
##Get revenue for a given order id.
%sql SELECT sum(order_item_id) from order_items where order_item_order_id =2

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(9,)]

In [13]:
%%sql

SELECT *
FROM order_items 
WHERE order_item_order_id = 2

 * postgresql://mako:***@pg.itversity.com:5432/mako
3 rows affected.

[(2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99)]

In [14]:
%%sql

SELECT round(sum(order_item_subtotal::numeric), 2) AS order_revenue
FROM order_items 
WHERE order_item_order_id = 2

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(Decimal('579.98'),)]

In [15]:
%%sql

SELECT count(1) 
FROM orders
WHERE order_status IN ('COMPLETE', 'CLOSED')

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(30455,)]

In [16]:
%%sql

SELECT order_date,
    count(1)
FROM orders
GROUP BY order_date
ORDER BY order_date
LIMIT 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 143),
 (datetime.datetime(2013, 7, 26, 0, 0), 269),
 (datetime.datetime(2013, 7, 27, 0, 0), 202),
 (datetime.datetime(2013, 7, 28, 0, 0), 187),
 (datetime.datetime(2013, 7, 29, 0, 0), 253),
 (datetime.datetime(2013, 7, 30, 0, 0), 227),
 (datetime.datetime(2013, 7, 31, 0, 0), 252),
 (datetime.datetime(2013, 8, 1, 0, 0), 246),
 (datetime.datetime(2013, 8, 2, 0, 0), 224),
 (datetime.datetime(2013, 8, 3, 0, 0), 183)]

In [17]:
%%sql

SELECT order_status,
    count(1) AS status_count
FROM orders
GROUP BY order_status
ORDER BY order_status
LIMIT 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
9 rows affected.

[('CANCELED', 1428),
 ('CLOSED', 7556),
 ('COMPLETE', 22899),
 ('ON_HOLD', 3798),
 ('PAYMENT_REVIEW', 729),
 ('PENDING', 7610),
 ('PENDING_PAYMENT', 15030),
 ('PROCESSING', 8275),
 ('SUSPECTED_FRAUD', 1558)]

In [18]:
%%sql

SELECT order_item_order_id,
    sum(order_item_subtotal) AS order_revenue
FROM order_items
GROUP BY order_item_order_id 
LIMIT 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(1, 299.98),
 (2, 579.98),
 (4, 699.85),
 (5, 1129.8600000000001),
 (7, 579.9200000000001),
 (8, 729.8399999999999),
 (9, 599.96),
 (10, 651.9200000000001),
 (11, 919.79),
 (12, 1299.8700000000001)]

In [20]:
%%sql

SELECT order_item_order_id,
    round(sum(order_item_subtotal)::numeric, 2) AS order_revenue
FROM order_items
GROUP BY order_item_order_id 
LIMIT 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(1, Decimal('299.98')),
 (2, Decimal('579.98')),
 (4, Decimal('699.85')),
 (5, Decimal('1129.86')),
 (7, Decimal('579.92')),
 (8, Decimal('729.84')),
 (9, Decimal('599.96')),
 (10, Decimal('651.92')),
 (11, Decimal('919.79')),
 (12, Decimal('1299.87'))]

In [21]:
%%sql

SELECT o.order_date,
    oi.order_item_product_id,
    round(sum(oi.order_item_subtotal::numeric), 2) AS revenue
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date,
    oi.order_item_product_id
LIMIT 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99'))]

In [22]:
%%sql

SELECT o.order_date,
    oi.order_item_product_id,
    round(sum(oi.order_item_subtotal::numeric), 2) AS revenue
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
    AND revenue >= 500
GROUP BY o.order_date,
    oi.order_item_product_id
LIMIT 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
(psycopg2.errors.UndefinedColumn) column "revenue" does not exist
LINE 5:     AND revenue >= 500
                ^

[SQL: SELECT o.order_date, oi.order_item_product_id, round(sum(oi.order_item_subtotal::numeric), 2) AS revenue
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
    AND revenue >= 500
GROUP BY o.order_date,
    oi.order_item_product_id
LIMIT 10]
(Background on this error at: https://sqlalche.me/e/14/f405)